from typing import List


# 두 송전답 A,B 사이에 전력을 공급하기 위한 송전 선로를 연결하려 함
# 송전탑과 송전 선로는 그래프 형태로 표현이 가능 노드: 송전탑 간선 :송전선로
# 모든 송전 선로의 가중치는 1
# A -> B를 연결하는 경로는 ( 단, 해당 경로에 포함되는 송전 선로의 가중치 합이 k이하, 지나간 송전탑 지나갈 수 없음)
# A 송전탑에서 B송전탑까지 가중치 합이 k이하인 경로에 포함되지 않는 송전 선로를 모두 제거한 뒤 남은 송전 선로는 몇개인지 return

def solution(n: int, edges: List[List[int]], k: int, a: int, b: int) -> int:
    answer = 0
    return answer


print(solution(8,
               [[0, 1], [1, 2], [2, 3], [4, 0], [5, 1], [6, 1], [7, 2], [7, 3], [4, 5], [5, 6], [6, 7]]
               , 4, 0,  3))  # 7
